{"description":"Made by Hama, assisted by Meteor w/ technical stuff","name":"Basic PvE Weapons rolls to look for","data":[{"description":"I've never really liked the feel of 150 rpm Scout Rifles until this one came along. I recommend Arrowhead / Fluted for Barrels and I'd prefer Flared / Tactical for Mags. Rapid Hit is one of the best Scout Perks, but you can also opt into Stats For All / Shoot to Loot if you wish. Explosive Payload / One For All /  Vorpal is generally good dmg perk options on a Scout, but this can also roll Headstone for Stasis builds. Recommended MW: Handling.","hash":1019000888,"name":"Perses-D","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,3142289711,1087426260,2420895100],[247725512,1583705720,3700496672],[124408337,4049631843,3038247973,1546637391],[1607056502]],"tags":["PVE","Mouse"]},{"description":"For PvE it's kind of hard to go wrong with Barrels on a Shotgun, although I'd recommend Corkscrew / Barrel Shroud. Assault Mag is nice, though I'd also say Tac Mag is just as good. Subsistence is pretty fun, but Lead From Gold is fine too. Vorpal is the best dmg option or Adren Junkie if you run Nade builds. Recommended MW: Handling / Range.","hash":1028582252,"name":"The Comedian","plugs":[[4090651448,1300023272,1482024992,1332244541,1047830412],[791862061,106909392,1087426260,2420895100,679225683,3142289711],[1820235745,1556840489],[1546637391,11612903]],"tags":["PVE","Mouse"]},{"description":"Rapid Hit is the main roll you want for Servant Leader. For Nade builds you can opt into Adren Junkie, but for general dmg perks you can go for One For All, Frenzy, Multikill Clip or Kill Clip. All are good options, but I'd prefer OFA or Frenzy. For Barrels I'd recommend Arrowhead / Fluted and for Mags I'd go for Flared / Tactical. MW: Handling.","hash":1107446438,"name":"Servant Leader","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[247725512],[4049631843,4104185692,11612903,2458213969,1015611457]],"tags":["GodPVE","Mouse"]},{"description":"This is basically THE roll for this gun. Arrowhead / Hammer are your go to Barrels and Accurized for your Mag, though Flared is no bad choice. Stats For All & One For all has such a big synergy together and this gun has the ability to proc both very easily with its high rate of fire. It's basically a bunch of stats and damage for free. Recommended MW: Range.","hash":1248372789,"name":"Sweet Sorrow","plugs":[[839105230,3250034553,1482024992,1840239774,4090651448,1392496348,1467527085,3661387068],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1409206216,1583705720],[859780267,4049631843],[1536798515]],"tags":["GodPVE","Mouse"]},{"description":"260 Scouts feel good to me in general. Arrowhead is your go to perk on Scouts in general, Fluted being a good 2nd option. You'll either want Reload or Range so I'd go for Flared, Tact Mag or Accurized in that order. Outlaw is a solid option, but Surplus is also strong. Redirection is your damage option, while Wellspring is your utility option for 4th column as there's not many flexible rolls on this weapon. Recommended MW: Handling.","hash":1392919471,"name":"Trustee","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,3142289711,1431678320,1087426260,2420895100],[3436462433,1168162263,1523832109],[3201496230,3592538738]],"tags":["PVE","Mouse"]},{"description":"A craftable Lightweight Bow. Not too big of a fan of Lightweight bows, but you can craft yourself a pretty good one with Elastic String and Fiberglass Arrow Shaft. To go with this you'd want Archer's Tempo or you can opt into Shoot To Loot if you'd like. This is another Bow that will give you the option of Explosive Head and Successful Warm-Up. Recommended MW: Draw Time.","hash":1399109800,"name":"Fel Taradiddle","plugs":[[2801223209,852209214,4067834857,1784898267,1196733167,3768438372],[3429800428,3827198035,3311977193,16392701,2154191829],[3523746922,201365942],[1551736345,617966211,3365897133,2652708987],[3754350707]],"tags":["PVE","Mouse"]},{"description":"A DPS machine. With Veist Stinger and Triple Tap you never have to reload, which makes this a super strong DPS option with Firing Line. Arrowhead Brake and Fluted are preferred along with Enhanced Mag, but you can opt into Liquid or Accelerated Coils based on preference. Recommended MW: Handling.","hash":1399243961,"name":"Reeds Regret","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1483536627],[3400784728],[1771339417],[3988215619]],"tags":["GodPVE","Mouse"]},{"description":"The craftable Throne World SMG. Fluted Barrel is your go to here, but Corkscrew / Hammer are good 2nd options. Armor Piercing is your go to for Mag, but Flared is also good. Perp Motion is pretty much your only option in the 3rd column. You have the options between Kill Clip and Swash for dmg perk or you can opt into Headstone for Stasis builds. Recommended MW: Range or Reload.","hash":1526296434,"name":"Forensic Nightmare","plugs":[[1840239774,4090651448,3250034553,1482024992,1392496348,839105230,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[2014892510,1428297954],[2923251173,1171887445,1161469972,1015611457,124408337,4082225868],[3717985200]],"tags":["PVE","Mouse"]},{"description":"Pretty lackluster SMG, but it has some okay rolls. Model 8 Red is the preferred Sight, but Model 6 Loop is an okay 2nd choice. Accurized / Flared are your best Mag choices. Overflow feels good on these SMG's, but Threat Detector is also fine. Osmosis helps utilize different builds while Vorpal is your only good dmg option other than Surrounded. MW: Range / Reload.","hash":1786797708,"name":"Escape Velocity","plugs":[[663495154,663495155],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[3643424744,4071163871],[1774574192,1546637391,3708227201]],"tags":["PVE","Mouse"]},{"description":"Jagged Edge is your go to for Swords, Honed is a fine 2nd choice. Swordmaster's 1st choice, but as long as you're avoiding Heavy Guard you're fine. Relentless Strikes is very good for when you're hitting one target, while Tireless Blade is good for when you're just killing ads. Frenzy is a solid option now that Vorpal is 10%. Recommended MW: Impact.","hash":1796949035,"name":"Razor's Edge","plugs":[[3666208348,2827049491,938542991],[269888150,52780822,599007201,3625355092],[1749209109],[4104185692],[3989629871]],"tags":["GodPVE","Mouse"]},{"description":"Summoner is a decent PvE weapon, paired with Perpetual Motion I feel you can opt more into Range than with Heating Up and Overflow. Preferred Barrels: Arrowhead / Hammerforged and preferred Mags: Armor Piercing / Flared. Multikill Clip and Rampage both work well with Perp Motion, with my preference being MKC. Golden Tricorn is a spicy option if you're running a Solar subclass. Recommended MW: Range.","hash":1907698332,"name":"The Summoner","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[1428297954],[2458213969,3425386926,2610012052]],"tags":["GodPVE","Mouse"]},{"description":"Overflow allows some very spicy mag sizes with Summoner and while I'd rather prefer Perp Motion it's a very valid option. My preferred Barrels are Arrowhead / Hammerforged with Armor Piercing / Flared as Mags. Rampage is your go to damage option with Overflow due to anti synergy with MKC, but Golden Tricorn is also a solid perk if you're running a Solar subclass. Recommended MW: Reload.","hash":1907698332,"name":"The Summoner","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[3643424744],[3425386926,2610012052]],"tags":["PVE","Mouse"]},{"description":"For Blinding Grenades additional Handling and Velocity is nice, making Quick Launch / Smart Drift ideal. Auto-Loading synergizes well with Blinding Grenades, Field Prep works fine, and Demo is always a good choice. Disruption Break for Match Game content. Recommended MW: Handling / Velocity.","hash":1946491241,"name":"Truthteller","plugs":[[3525010810,3798852852,3809316345,1441682018,1844523823,981914802],[3032599245],[3300816228,2869569095],[3523296417,1683379515]],"tags":["GodPVE","Mouse"]},{"description":"w/ Spike Grenades you want the lowest Blast Radius possible as it negatively affects your damage, making Hard Launch your best option, Quick Launch is my 2nd pick here. Feeding Frenzy and Multikill Clip have good nice synergy allowing you to chain kills easier. Demo is nice for Nade builds. Recommended MW: Handling / Velocity.","hash":1946491241,"name":"Truthteller","plugs":[[981914802,3525010810,3798852852,3809316345,1441682018,1844523823],[3301904089],[2779035018],[2458213969,3523296417]],"tags":["GodPVE","Mouse"]},{"description":"With Spike Grenades you want to have as low Blast Radius as possible as it negatively affects your damage. Hard Launch is therefore your best option, Quick Launch is my 2nd pick here. Auto-Loading is nice to have, but doesn't really synergize well with any other perk than Demo and maybe Disruption Break here, but I see DB as more of a Blinding options than when you're using Spike. Recommended MW: Handling / Velocity.","hash":1946491241,"name":"Truthteller","plugs":[[981914802,3525010810,3798852852,3809316345,1441682018,1844523823],[3301904089],[3300816228],[3523296417]],"tags":["PVE","Mouse"]},{"description":"Personally I enjoy this Fusion a lot. How I see it is that Rapid Fusions needs a dmg perk to feel good and for this one I'd go with Adagio for general use and Golden Tricorn for Void Nade builds. To go with this I'd say Perpetual Motion as my first choice and Stats For All as my 2nd. For Barrels I'd recommend Arrowhead / Fluted and Liquid Coils / Enhanced for Batteries. Recommended MW: Stability.","hash":1994645182,"name":"Likely Suspect","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1687452232,2680121939,3868766766,689005463,2969185026],[2014892510,1409206216,1428297954,1583705720],[2889515627,4290541820,859780267,3673922083,2610012052,4049631843],[2171055345]],"tags":["GodPVE","Mouse"]},{"description":"Arrowhead / Fluted is your go to Barrels here and ideally you'd get Flared / Tac Mag, but Accurized is also an option. Personally I feel Surplus is your best option in the 3rd column, but Feeding Frenzy and Outlaw are also good options. For damage you have the options of Vorpal and Kill Clip, I'm leaning towards the consistency of Vorpal imo. Demo is for Nade builds. Recommended MW: Handling or Range.","hash":2050789284,"name":"Stars In Shadow","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,3142289711,1431678320,1087426260,2420895100],[3436462433,2779035018,1168162263],[1546637391,1015611457,3523296417]],"tags":["PVE","Mouse"]},{"description":"Arrowhead Brake is my go to roll for most Auto Rifles, but Hammerforged / Fluted are also good Barrels. Flared would be my go to Mag here, but Tactical is also an option. While it lacks versatile rolls it can still get Subsistence or Outlaw paired with Vorpal. Dragonfly is alright. Recommended MW: Range.","hash":20935540,"name":"Arctic Haze","plugs":[[839105230,1840239774,3250034553,1482024992,4090651448,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,3142289711,1087426260,2420895100],[1168162263,1820235745],[1546637391,2848615171]],"tags":["PVE","Mouse"]},{"description":"A lot of people (including me), are not fans of the Lightweight Bow archetype, but at least this one can roll Vorpal so there's that. Elastic String is your go to, but Polymer is a good 2nd choice. I would recommend Fiberglass for Arrow, but Straight Fletching also works well. Archer's Tempo and Vorpal is primarily what you want here. Recommended MW: Draw Time.","hash":211938782,"name":"Whispering Slab","plugs":[[2801223209,852209214,4067834857,1784898267,1196733167,3768438372],[3429800428,3827198035,3311977193,16392701,2154191829],[201365942],[1546637391]],"tags":["PVE","Mouse"]},{"description":"A good feeling Hand Cannon. For the most part you'll want Hammer / Smallbore as your Barrels and either Accurized / Flared as your Mags. Explosive Payload is best in the 3rd column, but Osmosis is an option if you're speccing into Nades. Firefly is very satisfying to use, though you can also opt into Kill Clip or Frenzy for other dmg options. Adren Junkie is solid if you're speccing into Nade builds. Recommended MW: Range or Reload.","hash":2171478765,"name":"Fatebringer","plugs":[[3250034553,1482024992,4090651448,1840239774,1392496348,839105230,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[3038247973,1774574192],[3824105627,11612903,1015611457,4104185692]],"tags":["PVE","Mouse"]},{"description":"Best legendary Void bow as of Risen, 4th column can roll some interesting stuff like Dragonfly & Successful Warm-up if you wish to relive the Hush days, but I prefer to stick to Archer's Tempo + Explosive Head. Elastic String is preferred, but Polymer is also good. Fiberglass is what you want in your Arrow slot, with Straight Fletching being 2nd best. Recommended MW: Draw Time.","hash":232928045,"name":"Under Your Skin","plugs":[[2801223209,852209214,4067834857,1784898267,1196733167,3768438372],[3429800428,3827198035,3311977193,16392701,2154191829],[3523746922,201365942],[1551736345,169755979,3365897133,2848615171],[1536798515]],"tags":["GodPVE","Mouse"]},{"description":"You have a variety of options for this Hand Cannon. Truesight will be your go to Sight, but Fastdraw / Steady are also solid. High-Cal is preferred, but can opt into anything that gives Range / Reload. Outlaw, Rapid Hit and Perp Motion depends on preferences. Perp Motion > Rapid Hit > Outlaw for me. Kill Clip for dmg, Headstone for Stasis builds and Demo for Nade builds. Unrelenting can work combined with Headstone, but requires extra Reload. Recommended MW: Range.","hash":235827225,"name":"Eyasluna","plugs":[[1926090092,1926090095,1926090094,1926090093,1926090090],[1561002382,3230963543,679225683,1431678320,1885400500,1968497646,1087426260],[1428297954,247725512,1168162263],[1015611457,124408337,3523296417]],"tags":["GodPVE","Mouse"]},{"description":"DPS roll. Auto-Loading and Lasting Impression is a solid choice for DPS scenarios, but some will feel that the delayed explosion is unreliable. This comes down to preference in this case. Linear and Quick Launch are my go to Barrels and ideally you'd want Impact Casing, but Black Powder and High Velocity Rounds are also fine. Keep in mind that Precision's RL's have reduced damage. Recommended MW: Handling.","hash":2448907086,"name":"Royal Entry","plugs":[[1441682018,3525010810,3798852852,3809316345,1844523823,981914802],[3796465595,1996142143,2822142346,3492396210],[3300816228],[3927722942]],"tags":["GodPVE","Mouse"]},{"description":"While mostly considered a PvP gun, this Pulse does have a couple PvE rolls. Arrowhead / Fluted are your go to Barrels and High Cal / Arm Piercing for your Mag. The decision between Subsistence, Surplus and Overflow is largely preference, but I'd lean towards Surplus > Overflow > Subsistence. I like One For All here, but Rampage is fine as well. Recommended MW: Reload.","hash":2481758391,"name":"Darkest Before","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992],[1561002382,1968497646,679225683,3230963543,1885400500],[1820235745,3436462433,3643424744],[4049631843,3425386926]],"tags":["PVE","Mouse"]},{"description":"Various good combinations here, but 12/12's are gonna make your life miserable to look for a specific roll. For Barrels you'd want Arrowhead / Smallbore and for Mags: Accurized / Flared. Feeding Frenzy works very well with Multikill Clip and One For All for dmg options, but Surplus & Subsistence is also fine though. While MKC & OFA are your main dmg options you can also spec into Demo / Adren Junkie if you're running Nade builds. Recommended MW: Range.","hash":2496875173,"name":"Sorrows Verse","plugs":[[839105230,1482024992,4090651448,3250034553,1840239774,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[2779035018,3436462433,1820235745],[2458213969,3523296417,4049631843,11612903,3425386926,4104185692]],"tags":["PVE","Mouse"]},{"description":"With this Scout you can get some interesting rolls, I'd prefer Arrowhead / Fluted here and I'd pair that with High-Cal / Flared. Shoot to Loot is a very fun perk that can be very well utilized if you're of mind to do so. If not then I'd normally go for Stats For All as better, with SFA being my go to option. Multikill Clip would be my go to damage perk, but Vorpal and Adagio can also be good. Recommended MW: Handling.","hash":2638190703,"name":"Aishas Embrace","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,1561002382,679225683,1885400500,1968497646,1087426260,1431678320],[1583705720],[2458213969,1546637391,3673922083]],"tags":["GodPVE","Mouse"]},{"description":"Getting this weapon to drop is harder than getting a good roll as it's only a 3/3. Though if you do happen to get one then Elastic String is what you want, but Polymer is a fine 2nd choice. Straight Fletching is the best, however Helical is an okay substitute. Archer's Tempo and Explosive Head is generally what you want. Recommended MW: Draw Time.","hash":2721249463,"name":"Tyranny of Heaven","plugs":[[2801223209,852209214,1784898267,1196733167,3768438372],[3827198035,3311977193,2154191829],[201365942],[3365897133]],"tags":["PVE","Mouse"]},{"description":"The best roll on this gun imo. Stats For All and One For All is such a solid combo on guns that can utilize it. Arrowhead / Hammerforged are your go to Barrels along with Armor Piercing / Flared for your Mags. If you want more Range or Reload is down to preference. SFA and OFA is a really good combo for this gun as it basically gives you everything you want. Recommended MW: Range.","hash":2852052802,"name":"Krait","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[1583705720],[4049631843],[3988215619]],"tags":["GodPVE","Mouse"]},{"description":"Succession is a really solid PvE Sniper from DSC. Arrowhead is your go Barrel, but Fluted is also a solid choice. Here you want Extended Mag so you can reach 5 in the Mag with Backup Mag Mod, otherwise you want Tactical Mag. Reconstruction is amazing in both casual content and DPS scenarios. Vorpal is your best overall option, but Recombination is also not a bad option. Recommended MW: Handling or Reload.","hash":2990047042,"name":"Succession","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2420895100,106909392],[1523832109],[1546637391,469285294]],"tags":["GodPVE","Mouse"]},{"description":"This Rocket doesn't have much going for it, but is easily farmable early in the game. Quick / Smart Drift are your go to Barrels and ideally you'd want Alloy Casing, but Impact Casing also works. Field Prep or Impulse Amplifier are your best options. Lasting Impression is your go to option for damage. Recommended MW: Handling.","hash":3067821200,"name":"Heretic","plugs":[[3525010810,3798852852,1441682018,3809316345,981914802,1844523823],[2985827016,3796465595,1996142143,2822142346],[2869569095,951095735],[3927722942]],"tags":["PVE","Mouse"]},{"description":"180s are generally not considered to be in a great spot unfortunately. One For All / Multikill Clip are good general use dmg options, but you can also go for Adren Junkie for Nade builds. To pair with this you'd want Rapid Hit, but Outlaw is okay, Hammer / Smallbore are the Barrels I recommend and for Mags I'd say anything that gives Range and/or Reload. High Cal would be my preferred. Recommended MW: Range.","hash":310708513,"name":"Survivors Epitaph","plugs":[[1482024992,3250034553,4090651448,1840239774,1392496348,839105230,3661387068,1467527085],[679225683,3230963543,1885400500,1561002382,1968497646,1431678320,1087426260],[247725512,1168162263],[4049631843,2458213969,11612903]],"tags":["PVE","Mouse"]},{"description":"Not that many good options for this one sadly. Arrowhead / Fluted are your go Barrels and you can opt for Flared / Light Mag. For 3rd column there's  Surplus & Wellspring worth considering. Rewind Rounds can also be a fun perk to use. Firefly is a fun perk and is better than the alternative which is Frenzy or Kill Clip. Recommended MW: Stability or Handling.","hash":3186018373,"name":"Vision of Confluence","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,1467527085,3661387068],[3230963543,679225683,1431678320,1968497646,1885400500,1561002382,1087426260],[3436462433,3592538738,3418782618],[3824105627,4104185692,1015611457]],"tags":["PVE","Mouse"]},{"description":"Found Verdict has some solid PvE options, but primarily you'll want Auto-Loading to go with it, but Surplus can also work. Barrel Shroud / Corkscrew are your go to Barrels and while Assault is best, Appended is also fine for Mags. Vorpal and Frenzy are both good dmg options, but you can also opt into Demo for Nade builds or One-Two Punch if you're doing shenanigans around that. Recommended MW: Handling.","hash":3197270240,"name":"Found Verdict","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[791862061,1087426260,106909392,679225683,3142289711,2420895100],[3300816228,3436462433],[1546637391,4104185692,3523296417,2679249093]],"tags":["PVE","Mouse"]},{"description":"Special Mention: Amazing PvP roll.","hash":3197270240,"name":"Found Verdict","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[3142289711],[3436462433,3161816588],[47981717]],"tags":["GodPVP","Mouse"]},{"description":"Solid roll for gun as Explosive Payload procs on anything with no requirements. Arrowhead and Fluted is your go to Barrels and Mags such as Flared or Tactical, but Alloy works too. Rapid Hit works super well on Scouts as it gives you a lot of value in both Stability and Reload. Recommended MW: Handling or Stability.","hash":3242168339,"name":"Vouchsafe","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[247725512],[3038247973]],"tags":["GodPVE","Mouse"]},{"description":"This roll pairs well against Barrier champs as Vorpal will help you burst their shield faster. Arrowhead / Fluted are my preferred Barrels and due to Rapid Hit increasing Reload and Stability by so much I'd prefer to have Mags such as Flared / Tact Mag. Multikill Clip or Explosive Payload is also a viable option. Recommended MW: Stability or Handling.","hash":3242168339,"name":"Vouchsafe","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[247725512],[1546637391]],"tags":["PVE","Mouse"]},{"description":"You wanted Rapid Hit, but got Surplus instead. Arrowhead is your go to here, but Fluted isn't bad either. Both Flared & Tac Mag are good options. Ideally you'd want Rapid Hit instead, but Surplus is a serviceable 2nd option. Choosing between Vorpal and Explosive Payload is pretty hard, but EP is generally more reliable. Multikill Clip is also an option. Recommended MW: Stability or Handling.","hash":3242168339,"name":"Vouchsafe","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[3436462433],[1546637391,3038247973,2458213969]],"tags":["PVE","Mouse"]},{"description":"Hammerforged / Smallbore are your preferred Barrels and you'll want Accurized as your Mag, though Flared is also fine. Rapid Hit is your best option, but Surplus is also okay. Reconstruction is good value over time, but some will prefer other options. For damage perks you'll want One For All, but Redirection is also a fine choice, but is a bit more niche in how it works. Recommended MW: Range.","hash":3281285075,"name":"Posterity","plugs":[[3250034553,1482024992,4090651448,1840239774,1392496348,839105230,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[247725512,3436462433,1523832109],[4049631843,3201496230]],"tags":["PVE","Mouse"]},{"description":"I might have a bit of a controversial pick here as I'd really want Full Bore on this roll as I'd like to try and push out as much Range as possible along with Accurized due to having an abundance of stats from Perpetual Motion and Frenzy. This makes this my go to roll by far and if you're not buying stocks into Full Bore you can very well opt into Hammerforged / Smallbore. Recommended MW: Range.","hash":3341893443,"name":"Funnelweb","plugs":[[202670084,3250034553,1482024992,1467527085,4090651448,1840239774,1392496348,839105230],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1428297954],[4104185692],[3988215619]],"tags":["GodPVE","Mouse"]},{"description":"Very good roll for this SMG for Nade junkies out there. I'd want to try and push the Range with Hammerforged / Full Bore along with Accurized as you're getting a decent amount of Reload from Perpetual Motion. Since you've specced into a Nade build you can really make this roll shine by having high uptime on Adren Junkie. If this isn't your playstyle you'd want Frenzy instead. Recommended MW: Range.","hash":3341893443,"name":"Funnelweb","plugs":[[3250034553,202670084,1467527085,1482024992,4090651448,1840239774,1392496348,839105230],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1428297954],[11612903],[3988215619]],"tags":["GodPVE","Mouse"]},{"description":"Big fan of this gun. Hammerforged / Full Bore is nice to try and get some extra Range and you can pair this with Accurized, unless you want Flared. Subsistence means that you'll get a lot of ammo returns in more casual content so you can choose to pair this with either Frenzy or Adren Junkie as your dmg perks. If you're not going to consistently use Nades then Frenzy is for you. Recommended MW: Range. ","hash":3341893443,"name":"Funnelweb","plugs":[[3250034553,202670084,1467527085,1482024992,4090651448,1840239774,1392496348,839105230],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1820235745],[4104185692,11612903],[3988215619]],"tags":["PVE","Mouse"]},{"description":"Very solid Sniper for DPS situations. This will have better ammo economy than Succession, but slightly less shots per reload. It will also deal more damage due to Firing Line. Arrowhead / Fluted are your preferred Barrels and you'll want Appended Mag here in order to reach 5 in the mag with Backup Mag mod. Extended Mag is also an option, but is suboptimal. Recommended MW: Reload or Handling.","hash":3355385170,"name":"Silicon Neuroma","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1087426260,2420895100],[3400784728],[1771339417]],"tags":["GodPVE","Mouse"]},{"description":"A very good and easily obtainable Arc Precision Bow from the Monument in the Tower. Elastic String, Archer's Tempo and Vorpal are all solid on a Bow, it's a bit unlucky on the Arrow though so maybe one day we'll get a better replacement.","hash":3434944005,"name":"Point of the Stag","plugs":[[2801223209],[1500996326],[201365942],[1546637391]],"tags":["GodPVE","Mouse"]},{"description":"Solid Void Sniper from the Crucible. Arrowhead is as always a solid option on Sniper Rifles, while Fluted is a solid 2nd option. Appended allows you to reach 5 shots with Backup Mag Mod. Extended is sub optimal. Tac Mag allows you to hit 4 shots. Triple Tap is your best option for DPS scenarios if you have 5 in the mag, for normal usage: Clown / Auto-Loading + Vorpal is a reliable dmg option. Recommended MW: Handling or Reload.","hash":3473290087,"name":"Frozen Orbit","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[1087426260,2420895100,106909392],[2284787283,3400784728,3300816228],[1546637391]],"tags":["GodPVE","Mouse"]},{"description":"The only Aggressive Fusion Rifle we have right now and Coriolis Force is very solid for DPS situations. Arrowhead Brake or Fluted is my go to Barrels, with Enhanced Battery or Liquid Coils. Under Pressure and Pulse Monitor are both very good for DPS situations and Rangefinder gives extra Zoom. Recommended MW: Handling or Stability.","hash":3512349612,"name":"Coriolis Force","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553],[1687452232,2680121939],[972757866,1645158859],[2846385770]],"tags":["GodPVE","Mouse"]},{"description":"Solid DPS Slug Shotgun. Arrowhead / Fluted is the go to Barrels here, but for DPS it's mostly the last 2 perks you're looking for.\nAssault Mag is best, but Appended  / Tactical is also fine for Mags. Auto-Loading + Vorpal are the main perks you want here. Recommended MW: Handling or Range.","hash":3616586446,"name":"First In, Last Out","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553],[791862061,106909392,1087426260,3142289711],[3300816228],[1546637391]],"tags":["GodPVE","Mouse"]},{"description":"While mostly used in PvP, Messenger has okay PvE rolls too. Arrowhead / Fluted are your go to Barrels and High-Cal or Light Mag are your best options for Mag. Pulse Rifles synergize very well with Rapid Hit, but Stats for All or Outlaw are also solid options. One For All is a solid damage option, but Desperado is amazing to play with IMO. Recommended MW: Range or Handling.","hash":3658188704,"name":"The Messenger","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1431678320,1885400500,1968497646,1087426260],[247725512,1583705720,1168162263],[3047969693,4049631843]],"tags":["PVE","Mouse"]},{"description":"A mostly PvP SMG that can also be used in PvE. Smallbore / Fluted are your go to Barrels here, but Mag will depend on if you want Perp Motion or Killing Wind. With Killing Wind I'd say go for Flared / Tac Mag and with Perp Motion I'd say go for Accurized. Kill Clip is your most reliable dmg option, unless you're speccing into Nade builds in which case it's Adren Junkie. Golden Tricorn is a spicy option if you're running Void subclass. Recommended MW: Range or Reload.","hash":3682803680,"name":"Shayuras Wrath","plugs":[[1482024992,1840239774,3250034553,4090651448,1392496348,839105230,3661387068,1467527085],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1428297954,2450788523],[1015611457,11612903,2610012052]],"tags":["GodPVE","Mouse"]},{"description":"Pretty rough to farm this one, so if you have it that's pretty lucky. Quick / Smart Drift is your go to Barrels and ideally you'd want Impact Casing with Auto-Loading, but it's only a very small damage increase. You're basically just looking for Auto-Loading + Vorpal here as otherwise it's not really worth keeping around. Hothead ends up being easier to farm. Recommended MW: Handling. ","hash":3740842661,"name":"Sleepless","plugs":[[3525010810,3798852852,1441682018,3809316345,981914802,1844523823],[3796465595,2822142346,1996142143,2985827016],[3300816228],[1546637391]],"tags":["PVE","Mouse"]},{"description":"Sold Kinetic GL for Blinding Grenades as you can roll either Auto-Loading or Perp Motion. Quick Launch is your preferred Barrel, with Smart Drift being your 2nd option. Danger Zone will increase Blinding radius by 3m when procced, but free damage from Vorpal or extra on demand Nade from Demo is also good. Recommended MW: Handling or Velocity.","hash":3849810018,"name":"Pardon Our Dust","plugs":[[3525010810,3798852852,3809316345,1441682018,981914802,1844523823],[3032599245],[3300816228],[960810156,1546637391,3523296417]],"tags":["GodPVE","Mouse"]},{"description":"Kinetic GL with solid rolls. Hard Launch is my go to Barrel to get the Blast Radius lower, but Quick Launch is a good 2nd option. Ambitious is amazing on Special GL's, though you can also opt into Perp Motion or Auto-Loading if you prefer that. Vorpal is a good all around dmg option, but Adren Junkie can be good if you're into Nade builds. Demo is also an option. Recommended MW: Handling or Velocity.","hash":3849810018,"name":"Pardon Our Dust","plugs":[[981914802,3525010810,3798852852,3809316345,1441682018,1844523823],[3301904089],[2010801679,3300816228],[1546637391,3523296417,11612903]],"tags":["GodPVE","Mouse"]},{"description":"Void Slug Shotgun from Europa. While this isn't really a weapon I'd farm for, it is still a Slug that can roll Auto-Loading. Though lacking a real dmg perk does mean it's not that great. Arrowhead / Fluted is your go to Barrels and Assault Mag is a marginal DPS increase, but if you don't have it it's not that big of a deal. You'll want Auto-Loading in your 3rd column and then Demo in your 4th column. Recommended MW: Handling.","hash":4037745684,"name":"Bonechiller","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[791862061,1087426260,106909392,679225683,3142289711,2420895100],[3300816228],[3523296417]],"tags":["PVE","Mouse"]},{"description":"Your go to DPS option. While we may have better options for DPS such as Hothead, Hezen still does respectful damage as it can roll Lasting Impression. Vorpal is less desired after the nerf. Quick / Smart Drift is your go to Barrels and you'd want Impact Casing with Auto-Loading, though Black Powder is also fine. Recommended MW: Handling.","hash":4050645223,"name":"Hezen Vengeance","plugs":[[3525010810,3798852852,1441682018,3809316345,981914802,1844523823],[3796465595,1996142143,2822142346,2985827016],[3300816228],[3927722942,1546637391]],"tags":["GodPVE","Mouse"]},{"description":"This currently doesn't have much use tbh, but this is the first Stasis Sniper that we have. Arrowhead / Fluted are your go to options here and you'd want Appended / Extended to make it so you can reach 7 bullets in the Mag with Backup Mag Mod. Overflow feels very nice on a Sniper and will allow you to avoid reloading for the most part. Firing Line is your primary damage option, but you can also use Focused Fury. Recommended MW: Handling","hash":4067556514,"name":"Thoughtless","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553],[1087426260,2420895100],[2682205016,3643424744],[395388285,2402480669,1771339417,2896038713]],"tags":["GodPVE","Mouse"]},{"description":"Can roll the old reliable combination of Archer's Tempo + Explosive Head in the Kinetic slot as a Precision Bow which makes it a solid choice. You'll want Elastic String, but Polymer is the 2nd choice if you don't happen to have it. Straight Fletching is the preferred Arrow with Helical being your 2nd choice. Recommended MW: Draw Time","hash":4095896073,"name":"Accrued Redemption","plugs":[[2801223209,852209214,1784898267,1196733167,3768438372,3371775011],[3827198035,3311977193,16392701,2154191829],[201365942],[3365897133]],"tags":["GodPVE","Mouse"]},{"description":"Good Pulse for PvE activities. Preferred Barrels: Arrowhead / Fluted and preferred Mags: High-Cal / Light Mag, though you can use any that gives Range or Reload. Surplus works well on this and is what I'd pair with One For All here, but is flexible overall. Feeding Frenzy has good synergy with Multikill Clip, but can also be used with OFA or Vorpal. Subsistence also works with any of the 3. Recommended MW: Range.","hash":4156253727,"name":"The Third Axiom","plugs":[[839105230,1840239774,3250034553,1482024992,4090651448,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1885400500,1968497646,1431678320,1087426260],[3436462433,1820235745,2779035018],[4049631843,2458213969,1546637391]],"tags":["GodPVE","Mouse"]},{"description":"Very strong DPS and normal usage Shotgun. Arrowhead / Fluted are your go to Barrels and while Assault Mag is a marginal damage increase, it's not necessary. Reconstruction is very strong and Recombination will make your initial shot hit for a lot if you get the stacks going. Recommended MW: Handling or Range.","hash":4248569242,"name":"Heritage","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[791862061,1087426260,106909392,2420895100,679225683,3142289711],[1523832109],[469285294]],"tags":["GodPVE","Mouse"]},{"description":"Your go to DPS option for this Rocket Launcher. Quick / Smart Drift preferred, you'll want Impact Casing with Auto-Loading, but Black Powder is also fine. This gun has best options to go along with Auto-Loading as of now as it's an Adaptive with Explosive Light, Lasting Impression and Vorpal. Vorpal is less desired due to being the smaller buff. Recommended MW: Handling","hash":4255171531,"name":"The Hothead","plugs":[[3525010810,3798852852,1441682018,3809316345,981914802,1844523823],[3796465595,1996142143,2822142346,2985827016],[3300816228],[3194351027,3927722942,1546637391]],"tags":["GodPVE","Mouse"]},{"description":"Ambitious Assassin makes Special GL's feel very good, but you can also opt into Feeding Frenzy. Vorpal is your best passive dmg source, but Multikill Clip is good if you're planning to chain kills while Demo is for Nade builds. For Barrels I'd recommend Hard / Quick Launch as Blast Radius negatively affects your dmg with Spike. Recommended MW: Reload / Velocity.","hash":4255586669,"name":"Empty Vessel","plugs":[[981914802,3525010810,3798852852,3809316345,1441682018,1844523823],[3301904089],[2010801679,2779035018],[1546637391,2458213969,3523296417]],"tags":["GodPVE","Mouse"]},{"description":"Hammerforged and Smallbore are both good options. High-Cal is nice for extra flinch and Light Mag gives Range + Reload. Stats for All and One For All is a solid combination, but Outlaw and Overflow are also nice options for 3rd column. Preference in the end though. Rampage is still good for 4th Column. Recommended MW: Range / Reload.","hash":432476743,"name":"The Palindrome","plugs":[[1482024992,3250034553,4090651448,1840239774,1392496348,1467527085,839105230,3661387068],[1561002382,679225683,3230963543,1431678320,1885400500,1087426260,1968497646],[1583705720],[4049631843]],"tags":["PVE","Mouse"]},{"description":"Stats For All + One For All is a very good combination for this gun and is what I'd go for as it has very good synergy. Perpetual Motion and Vorpal is also nice, but I personally think it's wasted potential on this gun compared to this roll. For Barrels I'd recommend Arrowhead / Hammerforged and for Mags I'd go for Accurized / Flared. Recommended MW: Range.","hash":435216110,"name":"Duty Bound","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1583705720],[4049631843]],"tags":["GodPVE","Mouse"]},{"description":"The combination of Demo and Adren Junkie is very strong for the weapons that can make good use of it. This does kind of require speccing into a Nade build to make use of however. Arrowhead would be my go to Barrel with Fluted as 2nd option. Armor Piercing & Light Mag are both solid options. Recommended MW: Range.","hash":507038823,"name":"The Last Breath","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1467527085,3661387068,1392496348],[1968497646,679225683,3230963543,1431678320,1885400500,1561002382,1087426260],[3523296417],[11612903]],"tags":["GodPVE","Mouse"]},{"description":"Our first Legendary Trace Rifle and is super versatile in rolls. For general use you'd want One For All, but Golden Tricorn can be really good on a Solar subclass. Demo is for Nade builds. Perp Motion is my go to here, but Feeding Frenzy / Subsistence is fine too. Shoot 2 Loot is a very interesting perk and can work very well for people who like it. For Barrels I'd recommend Fluted / Hammerforged and for Batteries I'd go for Tactical / Light. Recommended MW: Range or Handling.","hash":548958835,"name":"Retraced Path","plugs":[[1840239774,3250034553,1482024992,4090651448,1392496348,839105230,3661387068,1467527085],[732557052,2749775325,2969185026,3868766766,2680121939],[1428297954,2779035018,1820235745,3700496672],[4049631843,2610012052,3523296417]],"tags":["GodPVE","Mouse"]},{"description":"A weapon from Arrivals that is now only available from Dares and isn't really worthwhile unless you have the specific roll of Feeding Frenzy and Vorpal. Fluted / Arrowhead are solid Barrels and Liquid Coils or Enhanced Battery for 2nd column. I would recommend just farming for a Plug One over this though as it is way easier to get a solid roll on it and is way easier to obtain. Recommended MW: Stability.","hash":607191995,"name":"Hollow Words","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1687452232,689005463,2680121939,3868766766,2969185026],[2779035018,1556840489],[1546637391]],"tags":["PVE","Mouse"]},{"description":"Generally you want Jagged Edge, with Honed Edge being the 2nd choice. While Swordmaster's is the best one, as long as it's not Heavy Guard you're generally fine. For DPS you'll want Relentless Strikes, but Tireless works for just killing normal ads. Whirlwind Blade is your go to for sustained DPS. Recommended MW: Impact.","hash":614426548,"name":"Falling Guillotine","plugs":[[3666208348,2827049491,938542991],[269888150,52780822,599007201,3625355092],[1749209109],[3913600130]],"tags":["GodPVE","Mouse"]},{"description":"Arrowhead is amazing on most Auto Rifles, but Fluted would be my 2nd choice. Flared / Tactical Mag are both solid options for Mags. Subsistence is generally the sought after perk in the 3rd column, but Overflow if you have an old one and Auto-Loading are also fine. and Multikill Clip & Demo are solid options for your 4th column perks, but Kill Clip, Rampage and Swash aren't bad either. MW: Range.","hash":821154603,"name":"Gnawing Hunger","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,1467527085,3661387068],[3230963543,106909392,3142289711,1431678320,1087426260,3177308360],[1820235745,3643424744,3300816228],[2458213969,3523296417,3425386926,1015611457,4082225868]],"tags":["PVE","Mouse"]},{"description":"This Sidearm feels really good to use, but it is kind of limited to Headstone for Stasis use unless you want Demo for Nade builds or you're fine with Swash or Surrounded as a dmg option. Perpetual Motion does pair really well with Sidearms, but Subsistence is also nice if you want that. Fluted / Corkscrew are my recommended Barrels along with Flared / Tactical for Mags. Recommended MW: Reload or Handling.","hash":829330711,"name":"Peacebond","plugs":[[1840239774,4090651448,1482024992,839105230,1392496348,3250034553,3661387068,1467527085],[3230963543,106909392,1087426260,3142289711,1431678320,2420895100],[1428297954,1820235745],[124408337,3523296417,4082225868,3708227201]],"tags":["PVE","Mouse"]},{"description":"Pretty solid SMG, but hard to get a good roll on. With Feeding Frenzy you're looking for One For All for general use / Adren Junkie for Nade builds. You can also opt into Demo for Nade builds. Swash is also viable. Hammer / Smallbore are the Barrels I'd go for here and Armor Piercing / Light Mag for Mags. Overflow, Surplus and Threat Detector also works very well here. Recommended MW: Range.","hash":875848769,"name":"Borrowed Time","plugs":[[3250034553,1482024992,4090651448,1840239774,839105230,1392496348,3661387068,1467527085],[1968497646,679225683,3230963543,1431678320,1885400500,1561002382,1087426260],[2779035018,3643424744,3436462433,4071163871],[4049631843,11612903,3523296417,4082225868]],"tags":["GodPVE","Mouse"]},{"description":"Frenzy enables Full Bore / Extended Barrel on this gun for extra Range. I'd optimally pair Frenzy with Overflow, but Feeding Frenzy / Surplus / Threat Detector isn't bad either. Preferred Barrels would be Hammerforged / Smallbore and for Mags I'd say Armor Piercing / Light Mag / Flared. Recommended MW: Range.","hash":875848769,"name":"Borrowed Time","plugs":[[3250034553,1482024992,4090651448,1840239774,1392496348,839105230,3661387068,1467527085],[1968497646,679225683,3230963543,1431678320,1885400500,1561002382,1087426260],[3643424744,4071163871],[4104185692]],"tags":["GodPVE","Mouse"]},{"description":"Stats For All and One For All combo is super potent. Fluted is your preferred Barrel here, but Arrowhead is also fine. You'll want to opt into Accurized for Mag, but Flared is also good. Stats for All is your best option in 3rd column, but some like Perpetual Motion or Shoot to Loot. Other than One For All you can opt into Golden Tricorn if you're running an Arc subclass. Recommended MW: Stability or Handling.","hash":927567426,"name":"Come To Pass","plugs":[[1840239774,839105230,1482024992,3250034553,4090651448,1392496348,3661387068,1467527085],[3230963543,106909392,3142289711,1087426260,1431678320,3177308360],[1409206216,2014892510,1583705720,1428297954],[859780267,4290541820,169755979,4049631843,2610012052,2848615171],[883366072]],"tags":["PVE","Mouse"]},{"description":"My go to roll for this gun. Arrowhead is good here, but Fluted would be my 2nd choice. Both Flared & Tact Mag work well on this gun, but feel free to opt into Alloy. Rapid Hit is an amazing perk for Scouts as it provides a lot of Reload+Stability. Explosive Payload is a nice dmg increase that will also help you deal with Barrier Champions. MW: Handling.","hash":3504336176,"name":"Night Watch","plugs":[[839105230,1840239774,1482024992,4090651448,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[247725512,1820235745,3643424744],[3038247973]],"tags":["GodPVE","Mouse"]},{"description":"The Rapid Fire Sniper to replace Ikelos. I mostly see this as a DPS Sniper in PvE as it doesn't really offer anything else. Arrowhead / Fluted are your best Barrel options.Tactical Mag allows you to hit 7 in the Mag. Triple Tap & Focused Fury have good synergy and gives you both ammo economy + higher damage than what Ikelos used to. Recommended MW: Handling.","hash":3865728990,"name":"Father's Sins","plugs":[[839105230,1840239774],[106909392],[573122728,3400784728],[2402480669,2896038713],[567997816]],"tags":["GodPVE","Mouse"]},{"description":"Your go to DPS roll on this weapon. Having access to Enhanced Auto-Loading & both Explosive Light / Lasting Impression makes this Rocket a beast for DPS. Quick / Linear Comp is your go to Barrels and while you'd prefer Impact Casting, Black Powder is also fine. Ideally you will craft this gun though and keep in mind that Precision RL have reduced dmg. Recommended MW: Handling.","hash":3489657138,"name":"Palmyra-B","plugs":[[3525010810,1441682018,3798852852,3809316345,981914802,1844523823],[3796465595,1996142143,2822142346,2985827016],[3528046508,3300816228],[2275087323,1167468626,3194351027,3927722942],[1607056502]],"tags":["GodPVE","Mouse"]},{"description":"Really fun Rocket Launcher that can make use of Golden Tricorn. Quick / Linear is your preferred Barrels and you'll ideally want Alloy Casing, but Impact Casing is also fine. I would opt into Field Prep or Ambitious Assassin here as I see this more as a gun you use for non DPS scenarios. I feel Frenzy is the best option here, but I enjoy running Golden Tricorn on it as Void makes this very easy to make use of. Lasting Impression is also a good option though. Recommended MW: Blast Radius.","hash":3175851496,"name":"Red Herring","plugs":[[3525010810,1441682018,1844523823,1478423395],[2985827016,3796465595],[2308090567,3797647183,2869569095,2010801679],[3007133316,1167468626,4290541820,4104185692,3927722942,2610012052],[82180537]],"tags":["PVE","Mouse"]},{"description":"Stats for All is pretty much your go to here. Arrowhead / Fluted are my recommended Barrels and Armor Piercing / Flared for Mags. You can pair Stats For All with Vorpal for general use or Adren Junkie if you're speccing into Nade builds. Recommended MW: Range.","hash":2097055732,"name":"Piece of Mind","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[1409206216,1583705720],[3418165135,2422968039,1546637391,11612903],[1536798515]],"tags":["GodPVE","Mouse"]},{"description":"A very potent SMG with spicy options such as Frenzy / Demo. For Barrels I'd recommend Hammerforged / Full Bore as your base Handling is already high. Accurized is solid, but you can also use Flared for Mag. Overflow is my preferred choice when combining it with Frenzy, but Subsistence and  Perp Motion are also good choices. You can also use Demo instead of Frenzy if you wish to spec more into Nades. Swashbuckler is also solid if you want that. Recommended MW: Range.","hash":3886416794,"name":"Submission","plugs":[[3250034553,202670084,1467527085,1482024992,4090651448,1840239774,1392496348,839105230,3661387068],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[2682205016,4245865861,2014892510,3643424744,1820235745,1428297954],[3007133316,1906147653,4104185692,3523296417],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"How I see it is that most of this Deliverance's potential lies behind Chill Clip and Stasis builds. This is further enabled by it having solid 3rd column perks such as Perpetual Motion / Demo to choose between. For Barrels I'd recommend Arrowhead / Fluted and Enhanced Mag / Liquid Coils for Batteries. Recommended MW: Handling.","hash":768621510,"name":"Deliverance","plugs":[[839105230,1840239774,4090651448,1482024992,1392496348,3250034553,3661387068,1467527085],[2680121939,1687452232,689005463,3868766766,2969185026],[2014892510,1906147653,1428297954,3523296417],[344235611,2978966579],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"A craftable Raid LFR that I would highly recommend getting. Arrowhead is my recommendation here, but Fluted is also a good Barrel option. Enhanced Battery makes you hit 6 in the Mag for when Fourth Times the Charm, you do not want 7 in the Mag as it makes Focused Fury proc after 4 shots compared to 3 when 6. if you don't have Enh Mag, use the Backup Mag mod. Bait & Switch is a very valid option now to be paired with Witherhoard for very high DPS. Recommended MW: Handling or Reload.","hash":999767358,"name":"Cataclysmic","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1687452232],[848860060,1354429876],[3744057135,2402480669,3078487919,2896038713],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"Stats For All and One For All is an amazing combo on guns it works well with. This is definitely one of them and is one of my recommended options for this gun. Arrowhead is your preferred Barrel, but Fluted is a solid 2nd option. For Mag you'd want Accurized, but Flared is also fine. Demo + Adren Junkie is another option if you're speccing into Nade builds. MW: Handling or Range.","hash":3428521585,"name":"Insidious","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1409206216,1583705720],[859780267,4049631843],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"Did you know that Danger Zone increases the range of Blinding Grenades by 3 meters when procced? Very good roll, use Quick Launch if you have it combined with Auto-Loading. If you don't end up liking Danger Zone feel free to opt for something else. Recommended MW: Velocity / Handling.","hash":4255586669,"name":"Empty Vessel","plugs":[[3525010810,1441682018,981914802,3798852852,3809316345,1844523823],[3032599245],[3300816228,2869569095],[960810156]],"tags":["GodPVE","Mouse"]},{"description":"Auto-Loading is a perk that rewards swapping weapons so is best utilized with a passive dmg perk like Vorpal or if you're speccing into a grenade build it can also supplement Demo. For Barrels I'd recommend Hard / Quick Launch as Blast Radius negatively affects your dmg with Spike. Recommended MW: Reload / Handling.","hash":4255586669,"name":"Empty Vessel","plugs":[[981914802,3525010810,3798852852,3809316345,1441682018,1844523823],[3301904089],[3300816228],[1546637391,3523296417]],"tags":["PVE","Mouse"]},{"description":"Arrowhead is amazing on a lot of weapons and this is definitely one of them. Fluted would be my 2nd choice. Both Flared / Tact Mag works well on this gun, but feel free to opt into Alloy. Rapid Hit is amazing for Scouts as it provides a lot of Reload+Stability. Demo is good for those of you who wish to spec into Nade builds while Multikill Clip and Rampage works well for extra damage. Though I'd personally go with Explosive Payload. Recommended MW: Range.","hash":3504336176,"name":"Night Watch","plugs":[[839105230,1840239774,1482024992,4090651448,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[247725512,1820235745],[3523296417,2458213969,3425386926]],"tags":["PVE","Mouse"]},{"description":"Chain Reaction on a Wave Frame oh boi. This would be my recommended roll for this weapon. Quick Launch is solid while Linear / Smart Drift are also good options. High Velocity is your go to Nade. Ambitious Assassin stands as an amazing Special GL perk, but Stats For All / Surplus is also an option. Recommended MW: Handling, Reload or Velocity.","hash":613334176,"name":"Forbearance","plugs":[[3525010810,1441682018,3798852852,3809316345,981914802,1844523823],[2822142346],[3797647183,1409206216,2010801679,1583705720],[598607952,2396489472],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"Iron Banner Sword with potential, AD clear edition. Jagged Edgeis your go to, but Honed is a fine 2nd choice. Swordmaster's Guard is your best option, but as long as you're avoiding Heavy you're fine. Relentless Strikes is very good for consistently hitting targets, while Tireless Blade is good for just killing ads. Tireless is your go to in casual content, where you can also mess with Unrelenting. Frenzy has potential on Swords now that Vorpal is 10% on Power weapons. Chain Reaction shines in casual content. Recommended MW: Impact.","hash":1796949035,"name":"Razor's Edge","plugs":[[3666208348,2827049491,938542991],[269888150,599007201,52780822,3625355092],[2590710093],[2396489472],[3989629871]],"tags":["PVE","Mouse"]},{"description":"Good DPS Sniper for it's time, now mostly replaced by Father's Sins. Arrowhead / Fluted are solid options and you'd want Tactical Mag to get the Mag size up to 7. Appended / Extended also works, but at lower benefit. Triple Tap & High Impact Reserves are your go to for DPS with Fourth Times the Charm also being good. Recommended MW: Handling or Range.","hash":1253087083,"name":"Ikelos_SR_V1.0.2","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[106909392,1087426260,2420895100],[3400784728,1354429876],[2213355989]],"tags":["PVE","Mouse"]},{"description":"One For All and Stats for All is so good on weapons that can reliably proc them. Arrowhead / Fluted is your go to on most Pulse Rifles. Accurized is my first choice for Barrels, but Flared is solid as well. SFA and OFA synergize really well and is the best roll for this Pulse in my opinion as it gives you basically everything you want in terms of stats and dmg. Recommended MW: Range.","hash":2342054803,"name":"Ogma PR6","plugs":[[839105230,1840239774,1482024992,3250034553,4090651448,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1583705720],[4049631843],[2839173408]],"tags":["GodPVE","Mouse"]},{"description":"The Grenadebuckler combo. Aim for Arrowhead and Fluted as your Barrels. For Mag I'd personally go for Flared as my 1st choice and Accurized as my 2nd choice. Demo & Adren Junkie has a big synergy and allows you to maintain a dmg boost and reload your gun. Recommended MW: Range or Reload.","hash":2342054803,"name":"Ogma PR6","plugs":[[839105230,1840239774,1482024992,3250034553,4090651448,1392496348,3661387068,1467527085],[3230963543,3142289711,106909392,1087426260,1431678320,2420895100],[3523296417],[11612903],[2839173408]],"tags":["PVE","Mouse"]},{"description":"This is a Kinetic Shotgun you'd mostly get for 1-2 Punch purposes in PvE. Barrel Shroud / Corkscrew are my recommended Barrels and Assault Mag or Accurized are your best Mag options, but also not important. Perpetual Motion or Slideshot are the 3rd column perks you want, but One-Two Punch is what defines this roll in the 4th column. Recommended MW: Handling.","hash":1679868061,"name":"Wastelander M5","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[791862061,3142289711,679225683,106909392,1087426260,2420895100],[1428297954,3161816588],[2679249093]],"tags":["PVE","Mouse"]},{"description":"A good Fusion Rifle overall. Reservoir Burst is my favorite Fusion perk and it enables synergy for easy Stats For All procs, but Surplus is also really good to have. For Barrels I'd say go for Arrowhead / Fluted and the Batteries I'd recommend are Liquid / Participle Repeater. Recommended MW: Handling or Stability.","hash":4114929480,"name":"Snorri FR5","plugs":[[839105230,1840239774,4090651448,1482024992,1392496348,3250034553,3661387068,1467527085],[1687452232,3868766766,2969185026,689005463,2680121939],[1583705720,3436462433],[1427256713],[2839173408]],"tags":["GodPVE","Mouse"]},{"description":"Pulse Rifle with a nice feel to it, but lackluster rolls. Arrowhead / Fluted are solid for Barrels. High-Cal is preferred, otherwise opt into Light Mag or options that give Range or Reload. Outlaw is a good choice in your 3rd column, but if you're running Frenzy you can run with Enhanced Hip-Fire Grip. Vorpal / Frenzy for damage, but you can opt into Headstone. Recommended MW: Range.","hash":2856514843,"name":"Syncopation-53","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1431678320,1885400500,1968497646,1087426260],[1347741687,1168162263],[3418165135,1171887445,1546637391,124408337],[4008116374]],"tags":["PVE","Mouse"]},{"description":"A fun lightweight shotgun for casual use. Barrel Shroud and Corkscrew are all good options here. Assault Mag and Accurized Rounds are both fine, but I prefer Assault Mag. Slideshot and Auto-Loading are both viable and will depend on your play style. Vorpal is your damage option. Recommended MW: Range.","hash":1821724780,"name":"Seventh Seraph CQC-12","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[791862061,3142289711,1087426260,106909392,679225683,2420895100],[3161816588,3300816228,1556840489],[1546637391]],"tags":["PVE","Mouse"]},{"description":"A solid aggressive SMG with relatively high base Handling, I would prefer Hammerforged or Smallbore as Barrels. Seraph Rounds is the best option in terms of Mag, Accurized or Flared being alternatives. Subsistence / Threat Detector are solid choices. Vorpal is the go to dmg perk, while Demo is there for Nade builds. Disruption Break also exists for busting Arc Shields then swapping weapons. Recommended MW: Range / Reload.","hash":2222560548,"name":"IKELOS_SMG_v1.0.2","plugs":[[3250034553,1482024992,4090651448,1840239774,1392496348,839105230,3661387068,1467527085],[1140096971,3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1820235745,4071163871],[3523296417,1546637391,1683379515]],"tags":["PVE","Mouse"]},{"description":"This is a Energy Shotgun you'd mostly get for 1-2 Punch purposes in PvE. For Barrels I'd recommend Barrel Shroud / Corkscrew and Assault or Tactical are your best Mag options. Perp Motion / Pulse Monitor / Threat Detector are the 3rd column perks you want, but One-Two Punch is what defines this roll in the 4th column. Recommended MW: Handling or Range.","hash":2563012876,"name":"Matador 64","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[791862061,106909392,1087426260,679225683,3142289711],[1428297954,972757866,4071163871],[2679249093]],"tags":["PVE","Mouse"]},{"description":"If you want to get the feel of Hush back this is the roll for you as it gets the Draw Time down to 270ms with Elastic String and Draw Time MW. Recommended MW: Draw Time.","hash":232928045,"name":"Under Your Skin","plugs":[[2801223209,4067834857,852209214,1784898267,1196733167,3768438372],[3429800428,3827198035,3311977193,16392701,2154191829],[3523746922,201365942],[617966211,2652708987],[1536798515]],"tags":["GodPVE","Mouse"]},{"description":"Overflow feels very nice in normal content. Having 2 in your mag is really nice on a Rocket Launcher as it allows you to guarantee kills on larger enemies. Impulse Amplifier is also an option for the very good reload it provides. For your dmg perks you generally want Vorpal or Lasting Impression. Quick Launch / Linear are my go to Barrels here along with Alloy Casing, but Impact Casing also works. Recommended MW: Handling.","hash":4050645223,"name":"Hezen Vengeance","plugs":[[3525010810,1441682018,3798852852,3809316345,981914802,1844523823],[2985827016,3796465595,1996142143,2822142346],[3643424744,951095735],[1546637391,3927722942]],"tags":["PVE","Mouse"]},{"description":"If you need more dmg to Barriers or wish to run Nade builds. Arrowhead / Hammerforged is the ideal here along with Accurized or Flared. Stats For All gives a ton of stats which is easily procced on this weapon. If you wish to take down Barrier Champions faster you'd want to go for Vorpal or if you're doing Nade builds Demo is your choice. In the end I'd rather run with One For All due to the synergy it has with Stats For All though. Recommended MW: Range.","hash":1248372789,"name":"Sweet Sorrow","plugs":[[839105230,3250034553,1482024992,1840239774,4090651448,1392496348,1467527085,3661387068],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1409206216,1583705720],[3418165135,1906147653,1546637391,3523296417],[1536798515]],"tags":["PVE","Mouse"]},{"description":"Perpetual Motion works on this gun, but it's not ideal. Arrowhead and Hammerforged are the Barrels you want and you'd pair this with Accurized or Flared for your Mags. Perpetual Motion is easy to proc and maintain, but in the end gives a lower benefit than Stats For All. One For All and Vorpal are your damage options, with One For All being very easy to proc. Demo is for Nade builds. Recommended MW: Range.","hash":1248372789,"name":"Sweet Sorrow","plugs":[[839105230,3250034553,1482024992,1840239774,4090651448,1392496348,1467527085,3661387068],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[2014892510,1428297954],[859780267,1906147653,3418165135,4049631843,3523296417,1546637391],[1536798515]],"tags":["PVE","Mouse"]},{"description":"The Raid wave frame has some solid rolls overall. Quick / Linear are both good Barrel options. High Velocity for Nades. Ambitious Assassin would be my recommendation, but Stats For All / Surplus is also solid. Golden Tricorn for Arc Subclasses, otherwise you want One For All or Chain Reaction. Personally I'd prefer Chain. Recommended MW: Handling, Reload Speed or Velocity.","hash":613334176,"name":"Forbearance","plugs":[[3525010810,1441682018,3798852852,3809316345,981914802,1844523823],[2822142346],[3797647183,1409206216,2010801679,1583705720],[859780267,4290541820,4049631843,2610012052],[3363267119]],"tags":["PVE","Mouse"]},{"description":"Hammerforged and Smallbore are both good options. High-Cal is nice for extra flinch and Light Mag gives Range + Reload. Outlaw and Overflow are nice options for 3rd column and One For All / Rampage are good for 4th Column. Recommended MW: Range or Reload.","hash":432476743,"name":"The Palindrome","plugs":[[1482024992,3250034553,4090651448,1840239774,1392496348,1467527085,839105230,3661387068],[1561002382,679225683,3230963543,1431678320,1885400500,1087426260,1968497646],[1168162263,3643424744],[4049631843,3425386926]],"tags":["GodPVE","Mouse"]},{"description":"A good Fusion Rifle overall. If you don't want Reservoir Burst then One For All is the dmg perk to go for, but Successful Warm-Up is also an option if you want to get a lower Charge Time. Stats For All / Surplus are both good options for what you want on a Fusion. For Barrels I'd recommend going for Arrowhead / Fluted and in terms of Batteries Enhanced / Accelerated. Recommended MW: Handling or Stability.","hash":4114929480,"name":"Snorri FR5","plugs":[[839105230,1840239774,4090651448,1482024992,1392496348,3250034553,3661387068,1467527085],[2680121939,689005463,1687452232,3868766766,2969185026],[1583705720,3436462433],[4049631843,2652708987],[2839173408]],"tags":["GodPVE","Mouse"]},{"description":"One For All / Frenzy / Rampage are solid dmg options here and pairs well with Perpetual Motion. Personally I'd like Stats For All + One For All, but this also works fine. Arrowhead / Hammerforged would be my recommended Barrels along with Accurized / Flared for Mags. Recommended MW: Range.","hash":435216110,"name":"Duty Bound","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1428297954],[4049631843,3425386926,4104185692]],"tags":["PVE","Mouse"]},{"description":"Frenzy / Rampage are solid dmg options here and works fine with Stats For All. Personally I'd like Stats For All + One For All, but this also works fine. Arrowhead / Hammerforged would be my recommended Barrels along with Accurized / Flared for Mags. Recommended MW: Range.","hash":435216110,"name":"Duty Bound","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[1583705720],[3425386926,4104185692]],"tags":["PVE","Mouse"]},{"description":"With Blinding Nades I think Disruption Break can be really strong for Match Game, but having Vorpal or Demo is also good. Auto-Loading is what you'd mostly want, but Field Prep is also neat. For Barrels I'd recommend going for Quick / Smart Drift. Recommended MW: Velocity / Handling.","hash":4255586669,"name":"Empty Vessel","plugs":[[3525010810,1441682018,981914802,3798852852,3809316345,1844523823],[3032599245],[3300816228,2869569095],[1546637391,3523296417,1683379515]],"tags":["PVE","Mouse"]},{"description":"Solid Rocket Launcher. Field Prep and Clown is a spicy combination, but Lasting Impression is also solid for more damage. Impulse Amplifier is also a solid choice in the 3rd column. Linear / Quick Launch would be my go to Barrels along with Alloy Casing, but Impact Casing is always solid as well. Precision Rockets have reduced damage, so keep that in mind. Recommended MW: Handling.","hash":2448907086,"name":"Royal Entry","plugs":[[1441682018,3525010810,3798852852,3809316345,1844523823,981914802],[2985827016,3796465595,1996142143,2822142346],[2869569095,951095735],[2284787283,3927722942]],"tags":["PVE","Mouse"]},{"description":"Arrowhead is amazing on most Auto Rifles, but Fluted is a solid 2nd option. Armor Piercing / Light Mag are good Mag options. For the Nade enthusiasts out there this weapon can roll the Demo and Adren Junkie combination, while others will prefer Subsistence and/or One For All. Demo + Osmosis if you're looking to build craft. Recommended MW: Range.","hash":507038823,"name":"The Last Breath","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1968497646,679225683,3230963543,1431678320,1885400500,1561002382,1087426260],[1820235745],[11612903,4049631843]],"tags":["PVE","Mouse"]},{"description":"Arrowhead is amazing on most Auto Rifles, but Fluted is a solid 2nd option. Armor Piercing / Light Mag are good Mag options. For the Nade enthusiasts out there this weapon can roll the Demo and Adren Junkie, while others might prefer Subsistence and/or One For All. Demo + Osmosis if you're looking to build craft. Recommended MW: Range.","hash":507038823,"name":"The Last Breath","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1968497646,679225683,3230963543,1431678320,1885400500,1561002382,1087426260],[3523296417],[4049631843,1774574192]],"tags":["PVE","Mouse"]},{"description":"This Auto Rifle can roll an interesting combination of perks. Arrowhead / Hammerforged are my go to Barrels along with Armor Piercing / Flared. Stats For All would be my 1st choice in the 3rd column, but Overflow & Subsistence are also good. Adagio gives a solid damage buff and you basically don't feel the downsides of it, but Vorpal / One For All is also solid options. The best roll for this is Stats For All + One For All though. Recommended MW: Range.","hash":2852052802,"name":"Krait","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[1583705720,3643424744,1820235745],[1546637391,3673922083],[3988215619]],"tags":["PVE","Mouse"]},{"description":"It's very hard to get a bad roll on this one. Quick / Smart Drift are my go to Barrels and since you don't have Auto-Loading my go to Mag is Alloy Casing, though Impact Casing is still a solid option. For normal use Field Prep and Impulse Amplifier is my preference in that order. Clown Cartridge works very well with Field Prep, but if you want dmg options opt for Explosive Light, Lasting Impression or Vorpal. Recommended MW: Handling.","hash":4255171531,"name":"The Hothead","plugs":[[3525010810,3798852852,1441682018,3809316345,981914802,1844523823],[2985827016,3796465595,1996142143,2822142346],[2869569095,951095735],[3194351027,3927722942,2284787283,1546637391]],"tags":["PVE","Mouse"]},{"description":"Demo + Adren Junkie is a super potent combo when you're speccing into nade builds. Arrowhead and Fluted are preferred Barrels and the options of Accurized and Flared is mostly preference for Mag. I would heavily recommend this perk combination if you're a grenade enthusiast. Stats for All + One For All is a better option if not. MW: Handling or Range.","hash":3428521585,"name":"Insidious","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1906147653,3523296417],[2422968039,11612903],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"A bit of a more unique perk combination. Dragonfly will help you proc One For All while also giving you AoE damage. Arrowhead / Fluted are preferred Barrels and Flared or Tact Mag for Mag. Though I'd recommend Stats For All + One For All or Demo+Junkie if you want more all around or Nade specced options. MW: Reload or Handling.","hash":3428521585,"name":"Insidious","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1087426260,1431678320,2420895100,3142289711],[169755979,2848615171],[859780267,4049631843],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"A very potent SMG that can roll Enhanced Swashbuckler. Enh Swash has a +2s duration over base which makes it a very good option imo. Hammerforged / Full Bore are your go to Barrels and either Accurized or Flared for Mag. Perp Motion would be my go to with Swash, but Overflow and Subsistence are good options too. If you want a more general roll you'd opt for Frenzy or Demo for Nade builds. Recommended MW: Range.","hash":3886416794,"name":"Submission","plugs":[[3250034553,202670084,1467527085,1482024992,4090651448,1840239774,1392496348,839105230,3661387068],[3142289711,3230963543,106909392,1431678320,1087426260,2420895100],[2014892510,2682205016,4245865861,1428297954,3643424744,1820235745],[1161469972,4082225868],[3363267119]],"tags":["GodPVE","Mouse"]},{"description":"Outlaw / Rapid Hit / Stats For All and One For All is a very potent combination. Hammerforged / Smallbore are your preferred Barrels here along with High-Cal / Light Mag as your Mags. You can also opt into Demo + Adren Junkie if you're speccing into Nade builds. Recommended MW: Range","hash":2888266564,"name":"Crisis Inverted","plugs":[[3250034553,1482024992,4090651448,1840239774,839105230,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1968497646,1885400500,1087426260,2420895100],[1168162263,1583705720,247725512],[4049631843]],"tags":["GodPVE","Mouse"]},{"description":"Demo + Adren Junkie is very strong if you wish to spec into grenade builds. Hammerforged / Smallbore are your preferred Barrels here along with High-Cal / Light Mag as your Mags. Stats For All + One For All would be my recommendation if you want a more general option. Recommended MW: Range","hash":2888266564,"name":"Crisis Inverted","plugs":[[3250034553,1482024992,4090651448,1840239774,839105230,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1968497646,1885400500,1087426260,2420895100],[3523296417],[11612903]],"tags":["GodPVE","Mouse"]},{"description":"Summoner is a decent PvE weapon, some people prefer Heating Up over Perp Motion and Overflow. Preferred Barrels are Arrowhead / Fluted and you'd want Flared / Alloy / Light as Mags. Though other Range / Reload options are good too. HU works well with MKC and Rampage, with me personally leaning towards MKC. Golden Tricorn is also a solid choice if running a Solar subclass. Recommended MW: Reload.","hash":1907698332,"name":"The Summoner","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[3230963543,1431678320,679225683,1968497646,1885400500,1561002382,1087426260],[1570042021],[2458213969,3425386926,2610012052]],"tags":["PVE","Mouse"]},{"description":"Overflow and Perpetual Motion are good substitutes for Stats For All. For Barrels you'll want Arrowhead / Fluted along with Armor Piercing / Flared for Mags. Overflow gives you a huge mag which is gonna feel good on a Rapid Fire, while Perp Motion will reward you for moving around. Personally I'd say Overflow > Perp Motion. Vorpal is your go to dmg option in general, but Adren Junkie is better for Nade builds. Recommended MW: Range.","hash":2097055732,"name":"Piece of Mind","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[2682205016,2014892510,3643424744,1428297954],[3418165135,2422968039,1546637391,11612903],[1536798515]],"tags":["PVE","Mouse"]},{"description":"Deliverance can also roll the very potent Demo + Adren Junkie combo if you're a fan of Nade builds. Recommended Barrels I'd say Arrowhead / Fluted and for Batteries I'd say Enhanced / Liquid Coils. Recommended MW: Handling.","hash":768621510,"name":"Deliverance","plugs":[[839105230,1840239774,4090651448,1482024992,1392496348,3250034553,3661387068,1467527085],[2680121939,1687452232,689005463,3868766766,2969185026],[1906147653,3523296417],[2422968039,11612903],[3363267119]],"tags":["PVE","Mouse"]},{"description":"","hash":235827225,"name":"Eyasluna","plugs":[[1926090095,1926090092,1926090094,1926090093],[1561002382,1885400500],[2846385770],[588594999,957782887]],"tags":["GodPVP","Mouse"]},{"description":"","hash":3473290087,"name":"Frozen Orbit","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[280464955,2866798147],[957782887,47981717]],"tags":["GodPVP","Mouse"]},{"description":"","hash":4255586669,"name":"Empty Vessel","plugs":[[3525010810,3798852852,3809316345,1441682018,1844523823,981914802],[409831596,3301904089],[3300816228],[1683379515]],"tags":["GodPVP","Mouse"]},{"description":"","hash":432476743,"name":"The Palindrome","plugs":[[3250034553,1482024992,4090651448],[1561002382,1885400500],[2450788523,1168162263],[2846385770]],"tags":["GodPVP","Mouse"]},{"description":"Recommended MW: Range.","hash":2171478765,"name":"Fatebringer","plugs":[[3250034553,1482024992,4090651448],[3142289711],[3038247973],[699525795,47981717]],"tags":["PVP","Mouse"]},{"description":"","hash":4248569242,"name":"Heritage","plugs":[[3250034553,1482024992,1840239774],[3142289711,791862061],[3161816588,1866048759],[957782887]],"tags":["PVP","Mouse"]},{"description":"Recommended MW: Draw Time.","hash":232928045,"name":"Under Your Skin","plugs":[[2801223209,852209214],[3429800428],[3118144663,1866048759],[1370847713,617966211,47981717,2652708987],[1536798515]],"tags":["PVP","Mouse"]},{"description":"","hash":2888266564,"name":"Crisis Inverted","plugs":[[3250034553,1482024992],[1561002382,1885400500],[588594999,2946784966],[2846385770]],"tags":["PVP","Mouse"]},{"description":"Recommended MW: Range.","hash":3341893443,"name":"Funnelweb","plugs":[[202670084,1467527085,3250034553,1482024992],[3142289711],[1428297954,2450788523],[2846385770],[3988215619]],"tags":["GodPVP","Mouse"]},{"description":"","hash":2990047042,"name":"Succession","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348],[3142289711,106909392,1431678320,2420895100],[2866798147,588594999],[957782887]],"tags":["PVP","Mouse"]},{"description":"","hash":3355385170,"name":"Silicon Neuroma","plugs":[[839105230,1840239774,4090651448,3250034553,1482024992,1392496348],[1561002382,1885400500,1968497646,679225683,3230963543,1087426260,1431678320],[957782887,280464955],[47981717]],"tags":["PVP","Mouse"]},{"description":"","hash":1821724780,"name":"Seventh Seraph CQC-12","plugs":[[1300023272,4090651448,1482024992,1332244541,1047830412],[791862061,3142289711],[706527188,3161816588],[957782887]],"tags":["PVP","Mouse"]},{"description":"","hash":3658188704,"name":"The Messenger","plugs":[[839105230,1840239774,3250034553,1482024992],[1561002382],[247725512],[3047969693]],"tags":["GodPVP","Mouse"]},{"description":"\n","hash":3658188704,"name":"The Messenger","plugs":[[839105230,1840239774,3250034553,1482024992],[1885400500],[247725512,1168162263],[3047969693]],"tags":["PVP","Mouse"]},{"description":"\n","hash":3658188704,"name":"The Messenger","plugs":[[839105230,1840239774,3250034553,1482024992],[1561002382],[1168162263],[3047969693]],"tags":["PVP","Mouse"]},{"description":"","hash":3616586446,"name":"First In, Last Out","plugs":[[1840239774,3250034553],[3142289711,791862061],[3161816588,1866048759],[47981717]],"tags":["PVP","Mouse"]},{"description":"","hash":1679868061,"name":"Wastelander M5","plugs":[[1300023272,4090651448,1482024992,1047830412],[791862061,3142289711],[1428297954,3161816588],[47981717,3673922083,438098033]],"tags":["PVP","Mouse"]},{"description":"","hash":1248372789,"name":"Sweet Sorrow","plugs":[[839105230],[3142289711],[2014892510,1428297954],[1523649716,1890422124],[1536798515]],"tags":["PVP","Mouse"]},{"description":"A DPS machine. Veist Stinger on this would be ideal, but Triple Tap is what makes this a super strong DPS option with Firing Line. Arrowhead Brake and Fluted are preferred along with Enhanced Mag, but you can opt into Liquid or Accelerated Coils based on preference. Recommended MW: Handling.","hash":1399243961,"name":"Reeds Regret","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1687452232,689005463,3868766766,2969185026],[3400784728],[1771339417]],"tags":["PVE","Mouse"]},{"description":"Veist Stinger feels very good on this LFR. Reed's shines as a solid LFR for both normal use and casual use. Clown Cartridge or Auto-Loading allows you to take the gun into whichever content you'd like. Arrowhead and Fluted are preferred barrels and Enhanced Battery is nice to push up your mag size. Vorpal is your go to DMG option for solo content and Firing Line for group content. Recommended MW: Handling.","hash":1399243961,"name":"Reeds Regret","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1687452232,689005463,3868766766,2969185026],[2284787283,3300816228],[1771339417,1546637391],[3988215619]],"tags":["PVE","Mouse"]},{"description":"Reed's shines as a solid LFR for both normal use and casual use. Clown Cartridge or Auto-Loading allows you to take the gun into whichever content you'd like. Arrowhead and Fluted are preferred barrels and Enhanced Battery is nice to push up your mag size. Vorpal is your go to DMG option for solo content and Firing Line for group content. Recommended MW: Handling.","hash":1399243961,"name":"Reeds Regret","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1687452232,689005463,3868766766,2969185026],[2284787283,3300816228],[1771339417,1546637391]],"tags":["PVE","Mouse"]},{"description":"Recommended MW: Range or Handling.","hash":2563012876,"name":"Matador 64","plugs":[[1300023272,4090651448,1482024992,1047830412],[3142289711,791862061],[1428297954,4071163871],[47981717]],"tags":["PVP","Mouse"]},{"description":"Recommended MW: Range.","hash":3682803680,"name":"Shayura's Wrath","plugs":[[3250034553,1482024992],[3142289711],[2450788523,1428297954,2946784966,1570042021],[1015611457]],"tags":["GodPVP","Mouse"]},{"description":"","hash":1107446438,"name":"Servant Leader","plugs":[[839105230,1840239774],[3142289711,3177308360],[2946784966,3436462433],[1015611457]],"tags":["PVP","Mouse"]},{"description":"","hash":1994645182,"name":"Likely Suspect","plugs":[[839105230,1840239774],[3868766766],[3920370755,280464955],[2889515627,3673922083],[2171055345]],"tags":["PVP","Mouse"]},{"description":"","hash":875848769,"name":"Borrowed Time","plugs":[[3250034553,1482024992],[1885400500,1561002382],[2846385770],[1890422124,4104185692]],"tags":["PVP","Mouse"]},{"description":"Disruption Break can work for you in Match Game content. Arrowhead / Fluted is your go to on most Pulse Rifles. Accurized is my first choice for Barrels, but Flared is solid as well. Stats For All / Perp Motion will provide you a good amount of stats so it's down to preference there. Disruption Break will be a very niche use case thing that will depend on the activity and how you like to utilize it. Recommended MW: Range.","hash":2342054803,"name":"Ogma PR6","plugs":[[839105230,1840239774,1482024992,3250034553,4090651448,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[1583705720,1428297954],[1683379515],[2839173408]],"tags":["PVE","Mouse"]},{"description":"With this Scout you can get some interesting rolls, I'd prefer Arrowhead / Fluted here and I'd pair that with High-Cal / Flared. Shoot to Loot is a very fun perk that can be very well utilized if you're of mind to do so. If not then I'd normally go for Stats For All as better, with SFA being my go to option. Multikill Clip would be my go to damage perk, but Vorpal and Adagio can also be good. Recommended MW: Handling.","hash":2638190703,"name":"Aishas Embrace","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,1561002382,679225683,1885400500,1968497646,1087426260,1431678320],[3700496672,3400784728],[2458213969,1546637391,3673922083]],"tags":["PVE","Mouse"]},{"description":"Certified Funny roll for this gun as with Triple Tap + Fourth Times The Charm you can just keep shooting for a long time if you're hitting precision shots. I wouldn't recommend using this in serious content though. Recommended MW: Handling.","hash":2638190703,"name":"Aishas Embrace","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2420895100,1087426260,679225683,3230963543,1885400500,1561002382,1968497646],[3400784728],[1354429876]],"tags":["PVE","Mouse"]},{"description":"Certified Funny roll for this gun as with Triple Tap + Fourth Times The Charm you can just keep shooting for a long time if you're hitting precision shots. I wouldn't recommend using this in serious content though. Recommended MW: Range.","hash":435216110,"name":"Duty Bound","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[2420895100,1087426260,106909392,1431678320,3230963543,3142289711,1885400500],[3400784728],[1354429876]],"tags":["PVE","Mouse"]},{"description":"This Auto Rifle can roll an interesting combination of perks. Arrowhead / Hammerforged are my go to Barrels along with Armor Piercing / Flared. Stats For All would be my 1st choice in the 3rd column, but Overflow / Subsistence are also solid options. Adagio gives a solid dmg buff and you basically don't feel the downsides of it, but Vorpal / One For All is also solid. The best roll for this is Stats For All + One For All though. Recommended MW: Range.","hash":2852052802,"name":"Krait","plugs":[[839105230,3250034553,1482024992,4090651448,1840239774,1392496348,3661387068,1467527085],[1968497646,3230963543,679225683,1431678320,1885400500,1561002382,1087426260],[3643424744,1820235745],[4049631843],[3988215619]],"tags":["PVE","Mouse"]},{"description":"Pulse Rifle with a nice feel to it, but lackluster rolls. Arrowhead / Fluted are solid for Barrels. High-Cal is preferred, otherwise opt into Light Mag or options that give Range or Reload. Outlaw is a good choice in your 3rd column, but if you're running Frenzy you can run with Enhanced Hip-Fire Grip. Vorpal / Frenzy for damage, but you can opt into Headstone. Recommended MW: Range.","hash":2856514843,"name":"Syncopation-53","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[1561002382,679225683,3230963543,1431678320,1885400500,1968497646,1087426260],[1347741687,3118144663,1168162263,1866048759],[3007133316,4104185692],[4008116374]],"tags":["PVE","Mouse"]},{"description":"Good Pulse for PvE activities. Disruption Break is unique in how you play around it, but can be very strong if utilized properly in Match Game. Preferred Barrels: Arrowhead / Fluted and preferred Mags: Armor Piercing, though you can use any that gives Range or Reload. Surplus works well on this and is what I'd pair with Disruption Break. Genesis if you're coping. Recommended MW: Range.","hash":4156253727,"name":"The Third Axiom","plugs":[[839105230,1840239774,3250034553,1482024992,4090651448,1392496348,3661387068,1467527085],[1968497646,1561002382,1885400500,679225683,3230963543,1431678320,1087426260],[3436462433],[1683379515]],"tags":["PVE","Mouse"]},{"description":"A good Fusion Rifle overall. Compulsive Reloader is an interesting perk, but overall I'm not convinced yet. The only use case for it right now is to keep shooting Reservoir Burst shoots is how I see it. For Barrels I'd say go for Arrowhead / Fluted and the Batteries I'd recommend are Liquid / Participle Repeater. Recommended MW: Handling or Stability.","hash":4114929480,"name":"Snorri FR5","plugs":[[839105230,1840239774,4090651448,1482024992,1392496348,3250034553,3661387068,1467527085],[1687452232,3868766766,2969185026,689005463,2680121939],[671806388],[1427256713],[2839173408]],"tags":["PVE","Mouse"]},{"description":"","hash":4114929480,"name":"Snorri FR5","plugs":[[839105230,1840239774,1392496348],[3868766766,689005463],[280464955,1570042021],[2652708987,2213355989],[2839173408]],"tags":["PVP","Mouse"]},{"description":"You can opt into a Shoot to Loot build here, but I'd prefer to pair that with Frenzy if possible. Other options like Adren Junkie, Kill Clip and OFA also works. For Barrels I'd recommend Arrowhead / Fluted and for Mags I'd say Flared / Tactical. Recommended MW: Handling.","hash":1107446438,"name":"Servant Leader","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[3700496672],[4104185692,11612903,1015611457,4049631843]],"tags":["PVE","Mouse"]},{"description":"Disruption Break can be viable in Match Game content, but is still very niche. Surplus / Outlaw pairs well with it and for Barrels I'd recommend Arrowhead / Fluted and for Mags I'dsay Flared / Tactical. Recommended MW: Handling or Range.","hash":2050789284,"name":"Stars In Shadow","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,3142289711,1431678320,1087426260,2420895100],[3436462433,1168162263],[1683379515]],"tags":["PVE","Mouse"]},{"description":"Servant Leader is super versatile, but the main roll you want to go for is Rapid Hit. Surplus is your 2nd choice, but far from as good. For Nade builds you can opt into Adren Junkie, but for general dmg perks you can go for One For All, Frenzy, Multikill Clip or Kill Clip. All are good options, but I'd prefer OFA or Frenzy. For Barrels I'd recommend Arrowhead / Fluted and for Mags I'd go for Flared / Tactical. Recommended MW: Handling.","hash":1107446438,"name":"Servant Leader","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3230963543,106909392,1431678320,1087426260,2420895100,3142289711],[3436462433,1168162263],[4049631843,4104185692,11612903,2458213969,1015611457]],"tags":["PVE","Mouse"]},{"description":"Unrelenting is more of a niche pick here, but can work well. Truesight will be your go to Sight, but Fastdraw / Steady Hand are also solid. Flared is preferred, but opting into Light Mag or anything that gives Reload. Outlaw, Rapid Hit and Perp Motion on a Hand Cannon depends on preferences. Perp Motion > Rapid Hit > Outlaw for me. Kill Clip for damage, Headstone for Stasis builds and Demo for Nade builds. Recommended MW: Range.","hash":235827225,"name":"Eyasluna","plugs":[[1926090092,1926090095,1926090094,1926090093,1926090090],[3230963543,679225683,1431678320,1561002382,1885400500,1968497646,1087426260],[3108830275],[1015611457,124408337,3523296417]],"tags":["PVE","Mouse"]},{"description":"Disruption Break can be good on primaries to enable your Kinetic special weapons to do more damage. Arrowhead / Fluted are your go Barrels and you can opt for Flared / Light Mag. For 3rd column there's Surplus & Wellspring worth considering. Recommended MW: Stability or Handling.","hash":3186018373,"name":"Vision of Confluence","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,1467527085,3661387068],[3230963543,679225683,1431678320,1968497646,1885400500,1561002382,1087426260],[3436462433,3592538738,3418782618],[1683379515]],"tags":["PVE","Mouse"]},{"description":"A lot more niche of a pick, but being a Solar Linear this does have use cases in GM content which is where Box Breathing + Dragonfly can be a good combination to go for. For Barrels I'd say go for Arrowhead / Fluted along with Enhanced / Liquid for Coils. MW: Handling or Reload.","hash":999767358,"name":"Cataclysmic","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[2680121939,1687452232],[169755979,2848615171],[23371658,2551157718],[3363267119]],"tags":["PVE","Mouse"]},{"description":"Rapid Hit with a dmg perk is solid go to if the other options don't appeal to you. Arrowhead is your preferred Barrel, but Fluted is a solid 2nd option. For Mag you'd want Accurized, but Flared is also fine. Demo + Adren Junkie is another option if you're speccing into Nade builds. Or Stats For All + One For All if you like that combo. MW: Handling or Range.","hash":3428521585,"name":"Insidious","plugs":[[839105230,1840239774,4090651448,1482024992,3250034553,1392496348,3661387068,1467527085],[3142289711,3230963543,106909392,1087426260,1431678320,2420895100],[2938480696,247725512],[859780267,288411554,4049631843,3425386926],[3363267119]],"tags":["GodPVE","Mouse"]}]}